{"keras_version": "1.2.0", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa1C:/Users/Zdenek/tensorflow/CarND-Cloning/model.py\u00da\b<lambda>&\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape": null, "output_shape_type": "raw", "arguments": {}, "function_type": "lambda", "batch_input_shape": [null, 25, 160, 3], "input_dtype": "float32", "trainable": true, "name": "lambda_5"}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "W_regularizer": null, "border_mode": "valid", "bias": true, "b_regularizer": null, "trainable": true, "name": "convolution2d_13", "W_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "nb_col": 1, "nb_filter": 3, "b_constraint": null, "nb_row": 1, "activation": "elu", "subsample": [1, 1]}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "W_regularizer": null, "border_mode": "valid", "bias": true, "b_regularizer": null, "trainable": true, "name": "convolution2d_14", "W_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "nb_col": 24, "nb_filter": 16, "b_constraint": null, "nb_row": 12, "activation": "linear", "subsample": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "border_mode": "valid", "trainable": true, "name": "maxpooling2d_9", "dim_ordering": "tf", "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_17", "p": 0.3}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "W_regularizer": null, "border_mode": "valid", "bias": true, "b_regularizer": null, "trainable": true, "name": "convolution2d_15", "W_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "nb_col": 12, "nb_filter": 24, "b_constraint": null, "nb_row": 4, "activation": "elu", "subsample": [2, 2]}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "border_mode": "valid", "trainable": true, "name": "maxpooling2d_10", "dim_ordering": "tf", "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_18", "p": 0.3}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_5"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "W_regularizer": null, "bias": true, "b_regularizer": null, "trainable": true, "name": "dense_13", "W_constraint": null, "output_dim": 512, "b_constraint": null, "input_dim": 336, "activation": "linear", "activity_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_9", "alpha": 1.0}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_19", "p": 0.5}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "W_regularizer": null, "bias": true, "b_regularizer": null, "trainable": true, "name": "dense_14", "W_constraint": null, "output_dim": 256, "b_constraint": null, "input_dim": 512, "activation": "linear", "activity_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_10", "alpha": 1.0}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_20", "p": 0.5}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "W_regularizer": null, "bias": true, "b_regularizer": null, "trainable": true, "name": "dense_15", "W_constraint": null, "output_dim": 1, "b_constraint": null, "input_dim": 256, "activation": "linear", "activity_regularizer": null}}]}